app/controllers/manufacturers_controller.rb

INSERT INTO "manufacturers" ("name", "responsible", "mail", "category", "compatible", "remarks", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @manufacturer = Manufacturer.new(manufacturer_params)
    if @manufacturer.save

SELECT "manufacturers".* FROM "manufacturers"
---
  def index
    @manufacturers = Manufacturer.all